#include "global.h"

#include "proc.h"
#include "hardware.h"
#include "bm.h"
#include "m4a.h"
#include "soundwrapper.h"
#include "fontgrp.h"
#include "face.h"
#include "uiutils.h"
#include "ctc.h"
#include "savemenu.h"
#include "ekrbattle.h"
#include "bmlib.h"
#include "mu.h"
#include "bmsave.h"
#include "sysutil.h"
#include "efxbattle.h"

#include "constants/faces.h"

/*
@ division runtime
fun __divsi3, __aeabi_idiv
fun __modsi3, __aeabi_idivmod
fun __udivsi3, __aeabi_uidiv
fun __umodsi3, __aeabi_uidivmod

dat 0x02000000, gUnk_ModeSelect_02000000
dat 0x02000001, gUnk_ModeSelect_02000001
dat 0x020000A4, gUnk_020000A4
dat 0x0201E8D4, gUnk_0201E8D4
dat 0x0201E97C, gUnk_0201E97C
dat 0x0201E9F4, gUnk_0201E9F4
*/

#define ApplySystemObjectsGraphics LoadObjUIGfx
#define SetBgOffset BG_SetPosition
#define Proc_LockEachMarked Proc_BlockEachMarked
#define ApplyPaletteExt CopyToPaletteBuffer
#define SpawnProc Proc_Start
#define SetFaceConfig SetupFaceGfxData
#define TmApplyTsa_thm CallARM_FillTileRect
#define GetBgChrOffset GetBackgroundTileDataOffset
#define fe7u_func_08063FE0 ResetClassReelSpell
#define fe7u_func_08054E10 sub_805A940
#define fe7u_func_08054C8C sub_805A7B4
#define fe7u_func_08054EF0 sub_805AA28
#define fe7u_func_080A86A0 sub_80AC6AC
#define fe7u_func_08001F3C sub_800154C
#define SetOnHBlankA SetPrimaryHBlankHandler
#define InitBgs SetupBackgrounds
#define EnablePalSync EnablePaletteSync
#define LoadMetaSave ReadGlobalSaveInfo
#define MetaSave_CountCompletedPlaythroughs GetGlobalCompletionCntByInfo
#define fe7u_func_08054E88 NewEfxAnimeDrvProc

#define gBg0Tm gBG0TilemapBuffer
#define gBg1Tm gBG1TilemapBuffer
#define gBg3Tm gBG3TilemapBuffer
#define gPal gPaletteBuffer

struct Unk_020000A4
{
    struct Font font;
    struct Text text[7];
};
extern struct Unk_020000A4 gUnk_020000A4;

struct ModeSelectProc
{
    /* 00 */ PROC_HEADER;
    /* 2C */ s32 unk_2c;
    /* 30 */ u16 unk_30;
    /* 32 */ u16 unk_32;
    /* 34 */ s32 unk_34;
    /* 38 */ void * unk_38;
    /* 3C */ void * unk_3c; // pFaceProc
    /* 40 */ u8 unk_40;
    /* 41 */ u8 unk_41;
    /* 42 */ u8 unk_42;
    /* 43 */ u8 unk_43[3];
    /* 46 */ STRUCT_PAD(0x46, 0x49);
    /* 49 */ u8 unk_49[3];
    /* 4C */ u8 unk_4c;
    /* 50 */ s32 unk_50;
};

extern struct AnimBuffer gUnk_0201E8D4[];

extern struct AnimMagicFxBuffer gUnk_0201E97C[];

extern u8 gUnk_ModeSelect_02000000;
extern u8 gUnk_ModeSelect_02000001;

// ==============
// TODO:
// ==============

void fe7u_func_080AACD8(u16 * param_1, u8 * param_2, u16 param_3)
{
    Decompress(param_2, gGenericBuffer);
    TmApplyTsa_thm(param_1, gGenericBuffer, param_3);
    return;
}

u32 fe7u_func_0809EFBC(void)
{
    return 1;
};

int fe7u_func_0809E9FC(void)
{
    // int cVar1;
    // int iVar2;
    // struct GlobalSaveInfo auStack_70;

    int uVar3 = 0;
/*
    if (LoadMetaSave(&auStack_70))
    {
        iVar2 = MetaSave_CountCompletedPlaythroughs(&auStack_70);

        // FIXME
        cVar1 = fe7u_func_0809EFBC();
        uVar3 = (int)(-cVar1 | cVar1) >> 0x1f & 2;

        if ((auStack_70.completed) != 0)
        {
            if ((auStack_70.Eirk_mode_easy || auStack_70.Eirk_mode_norm) != 0)
            {
                uVar3 = 0xf;
            }

            if ((auStack_70.Eirk_mode_hard) != 0)
            {
                uVar3 = uVar3 | 0x10;
            }

            if (iVar2 > 4)
            {
                uVar3 = uVar3 | 0x10;
            }
        }
    }
*/
    uVar3 = 0x1f;
    return uVar3;
}

// clang-format off

int const gUnk_08CE48C0[4][3] = {
    {
        // 0x000004DE, // Lyn
        // 0x000012B3, // Swordfighter of Sacae[.]
        // 0x000012B8, // Swd[.]
        0x212, // "Eirika"
        0x78B, // "The Valiant"
        0x4FE, // "Str"
    },
    {
        // 0x000004DC, // Eliwood
        // 0x000012B4, // Nobleman of Pherae
        // 0x000012B8, // Swd[.]
        0x220, // "Ephraim"
        0x78B, // "The Valiant"
        0x4FE, // "Str"
    },
    {
        //0x000004DD, // Hector
        //0x000012B5, // Marquess Ostia's brother
        //0x000012B9, // Axe[.]
        0x234, // "Lyon"
        0x78B, // "The Valiant"
        0x4FF, // "Mag"
    },
    {
        // 0x000012B6, // Main character:[.]
        // 0x00000000, 
        // 0x000012B7, // Weapon:[.]
        0x5A1, // "Pick"
        0,
        0x4F2, // "Equip"
    }
};

// clang-format on

void fe7u_func_08054E5C(struct AnimBuffer * pAnimBuf)
{
    pAnimBuf->anim1->state3 |= 8;
    pAnimBuf->anim2->state3 |= 8;
    return;
}

// palette
void fe7u_func_080A73F8(s32 param_1)
{
}

// clang-format off

u16 const BgConfig_08CE3C0C[] = {
    0x0000, 0x6000, 0x0000, 
    0xC000, 0x6800, 0x0000, 
    0x8000, 0x7800, 0x0000, 
    0x8000, 0x7800, 0x0000,
};

// clang-format on

extern u16 Pal_084138F0[]; // pal
extern u16 Pal_0840F9A0[]; // pal

extern u8 Img_08418E44[]; // gfx
extern u8 Img_0840FEB4[]; // gfx

extern u8 Tsa_0840FA00[]; // tsa?
extern u8 Tsa_08411F34[]; // tsa?

// Blend effect on the spell circle

void fe7u_func_080A32D4(void)
{
    u16 vcount = REG_VCOUNT + 1;

    if (vcount > DISPLAY_HEIGHT) {
        vcount = 0;
    }

    if ((vcount & 1) != 0) {
        return;
    }

    if (vcount < gUnk_ModeSelect_02000000) {
        REG_BLDCNT = 0xc1;
        REG_BLDY = (gUnk_ModeSelect_02000000 != 0) 
            ? (gUnk_ModeSelect_02000000 - vcount) * 0x10 / gUnk_ModeSelect_02000000 
            : 0;

    } else {
        REG_BLDCNT = 0x144;
        REG_BLDALPHA = gUnk_ModeSelect_02000001 | 0x1000;
    }

    return;
}


void fe7u_func_080A4E58(void)
{
    InitBgs((u16 *)BgConfig_08CE3C0C);

    gLCDControlBuffer.dispcnt.mode = 1;

    gLCDControlBuffer.bg2cnt.screenSize = 1;
    gLCDControlBuffer.bg2cnt.areaOverflowMode = 0;

    gLCDControlBuffer.bg0cnt.priority = 3;
    gLCDControlBuffer.bg1cnt.priority = 0;
    gLCDControlBuffer.bg2cnt.priority = 2;
    gLCDControlBuffer.bg3cnt.priority = 2;

    EndAllMus();

    SetDispEnable(0, 0, 0, 0, 0);

    gUnk_ModeSelect_02000001 = 10;
    gUnk_ModeSelect_02000000 = 100;

    SetOnHBlankA(fe7u_func_080A32D4);

    ApplyPaletteExt(Pal_084138F0, 0x220, 0x100);
    ApplyPaletteExt(Pal_0840F9A0, 0, 0x60);

    Decompress(Img_08418E44, (void *)(GetBgChrOffset(BG_0) + 0x6000000));
    TmApplyTsa_thm(gBg0Tm, Tsa_0840FA00, 0);

    Decompress(Img_0840FEB4, (void *)(GetBgChrOffset(BG_3) + 0x6000000));
    fe7u_func_08001F3C(gBg3Tm, Tsa_08411F34, 0, 5);

    BG_EnableSyncByMask(BG3_SYNC_BIT);

    return;
}

// =========
// end todo
// =========

struct ModeSelectSpriteDrawProc
{
    /* 00 */ PROC_HEADER;
    /* 2C */ s32 unk_2c;
    /* 30 */ s32 unk_30;
    /* 34 */ s32 unk_34;

    /* 38 */ s32 unk_38;
    /* 3C */ u8 unk_3c;
    /* 3E */ u16 unk_3e;
    /* 40 */ s32 unk_40;
    /* 44 */ s32 unk_44;
    /* 48 */ s32 unk_48;
    /* 4C */ u8 unk_4c;
    /* 4D */ u8 unk_4d;
    /* 4E */ u8 unk_4e;
};

const u8 * const gUnk_08CE480C[] = {
    (u8 *)0x020000F4,
    (u8 *)0x020020F4,
    (u8 *)0x020040F4,
};

const u8 * const gUnk_08CE4818[] = {
    (u8 *)0x020060F4,
    (u8 *)0x0200B8F4,
    (u8 *)0x020110F4,
};

const u8 * const gUnk_08CE4824[] = {
    (u8 *)0x020168F4,
    (u8 *)0x02016994,
    (u8 *)0x02016A34,
};

const u8 * const gUnk_08CE4830[] = {
    (u8 *)0x02016AD4,
    (u8 *)0x020194D4,
    (u8 *)0x0201BED4,
};

// anims?
const int gUnk_08418DA8[] = {
    2,
    0,
    0x9c,
};

// FE7U: 0x080A7480
void InitModeSelectAnims(int count, u8 * arg_1)
{
    int i;

    for (i = 0; i < count; i++)
    {
        gUnk_0201E8D4[i].xPos = 320;
        gUnk_0201E8D4[i].yPos = 88;
        gUnk_0201E8D4[i].animId = gUnk_08418DA8[arg_1[i]];
        gUnk_0201E8D4[i].roundType = 6;
        gUnk_0201E8D4[i].genericPalId = 0;
        gUnk_0201E8D4[i].state2 = 1;
        gUnk_0201E8D4[i].oam2Tile = (i * 0x2000 + 0x2000) >> 5;
